MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX330F064H.atdf
      <value-group caption="Positive Input Select bits for Sample A" name="AD1CHS__CH0SA">
         <value caption="Channel 0 positive input is Open" name="OPEN" value="0x1e" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="CTMUT" value="0x1d" />
         <value caption="Channel 0 positive input is IVREF" name="IVREF" value="0x1c" />
         <value caption="Channel 0 positive input is AN27" name="AN27" value="0x1b" />
         <value caption="Channel 0 positive input is AN26" name="AN26" value="0x1a" />
         <value caption="Channel 0 positive input is AN25" name="AN25" value="0x19" />
         <value caption="Channel 0 positive input is AN24" name="AN24" value="0x18" />
         <value caption="Channel 0 positive input is AN23" name="AN23" value="0x17" />
         <value caption="Channel 0 positive input is AN22" name="AN22" value="0x16" />
         <value caption="Channel 0 positive input is AN21" name="AN21" value="0x15" />
         <value caption="Channel 0 positive input is AN20" name="AN20" value="0x14" />
         <value caption="Channel 0 positive input is AN19" name="AN19" value="0x13" />
         <value caption="Channel 0 positive input is AN18" name="AN18" value="0x12" />
         <value caption="Channel 0 positive input is AN17" name="AN17" value="0x11" />
         <value caption="Channel 0 positive input is AN16" name="AN16" value="0x10" />
         <value caption="Channel 0 positive input is AN15" name="AN15" value="0xf" />
         <value caption="Channel 0 positive input is AN14" name="AN14" value="0xe" />
         <value caption="Channel 0 positive input is AN13" name="AN13" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample A" name="AD1CHS__CH0NA">
         <value caption="Channel 0 negative input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="VREFL" value="0x0" />
      </value-group>
      <value-group caption="Positive Input Select bits for Sample B" name="AD1CHS__CH0SB">
         <value caption="Channel 0 positive input is Open" name="" value="0x1e" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="" value="0x1d" />
         <value caption="Channel 0 positive input is IVREF" name="" value="0x1c" />
         <value caption="Channel 0 positive input is AN27" name="" value="0x1b" />
         <value caption="Channel 0 positive input is AN26" name="" value="0x1a" />
         <value caption="Channel 0 positive input is AN25" name="" value="0x19" />
         <value caption="Channel 0 positive input is AN24" name="" value="0x18" />
         <value caption="Channel 0 positive input is AN23" name="" value="0x17" />
         <value caption="Channel 0 positive input is AN22" name="" value="0x16" />
         <value caption="Channel 0 positive input is AN21" name="" value="0x15" />
         <value caption="Channel 0 positive input is AN20" name="" value="0x14" />
         <value caption="Channel 0 positive input is AN19" name="" value="0x13" />
         <value caption="Channel 0 positive input is AN18" name="" value="0x12" />
         <value caption="Channel 0 positive input is AN17" name="" value="0x11" />
         <value caption="Channel 0 positive input is AN16" name="" value="0x10" />
         <value caption="Channel 0 positive input is AN15" name="" value="0xf" />
         <value caption="Channel 0 positive input is AN14" name="" value="0xe" />
         <value caption="Channel 0 positive input is AN13" name="" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample B" name="AD1CHS__CH0NB">
         <value caption="Channel 0 negative input is AN1" name="" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Pin Scan Selection bits" name="AD1CSSL__CSSL0">
         <value caption="Select AN0 for input scan; CSSL0 = AN0" name="" value="0x1" />
         <value caption="Skip AN0 for input scan; CSSL0 = AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Pin Scan Selection bits" name="AD1CSSL__CSSL1">
         <value caption="Select AN1 for input scan; CSSL1 = AN1" name="" value="0x1" />
         <value caption="Skip AN1 for input scan; CSSL1 = AN1" name="" value="0x0" />
      </value-group>
