MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX330F064H.atdf
         <register caption="" name="CNSTATB" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB" />
            <bitfield mask="0x00000002" name="CNSTATB" />
            <bitfield mask="0x00000004" name="CNSTATB" />
            <bitfield mask="0x00000008" name="CNSTATB" />
            <bitfield mask="0x00000010" name="CNSTATB" />
            <bitfield mask="0x00000020" name="CNSTATB" />
            <bitfield mask="0x00000040" name="CNSTATB" />
            <bitfield mask="0x00000080" name="CNSTATB" />
            <bitfield mask="0x00000100" name="CNSTATB" />
            <bitfield mask="0x00000200" name="CNSTATB" />
            <bitfield mask="0x00000400" name="CNSTATB" />
            <bitfield mask="0x00000800" name="CNSTATB" />
            <bitfield mask="0x00001000" name="CNSTATB" />
            <bitfield mask="0x00002000" name="CNSTATB" />
            <bitfield mask="0x00004000" name="CNSTATB" />
            <bitfield mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNSTATC" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC" />
            <bitfield mask="0x00000002" name="CNSTATC" />
            <bitfield mask="0x00000004" name="CNSTATC" />
            <bitfield mask="0x00000008" name="CNSTATC" />
            <bitfield mask="0x00000010" name="CNSTATC" />
            <bitfield mask="0x00000020" name="CNSTATC" />
            <bitfield mask="0x00000040" name="CNSTATC" />
            <bitfield mask="0x00000080" name="CNSTATC" />
            <bitfield mask="0x00000100" name="CNSTATC" />
            <bitfield mask="0x00000200" name="CNSTATC" />
            <bitfield mask="0x00000400" name="CNSTATC" />
            <bitfield mask="0x00000800" name="CNSTATC" />
            <bitfield mask="0x00001000" name="CNSTATC" />
            <bitfield mask="0x00002000" name="CNSTATC" />
            <bitfield mask="0x00004000" name="CNSTATC" />
            <bitfield mask="0x00008000" name="CNSTATC" />
         </register>
         <register caption="" name="CNSTATD" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD" />
            <bitfield mask="0x00000002" name="CNSTATD" />
            <bitfield mask="0x00000004" name="CNSTATD" />
            <bitfield mask="0x00000008" name="CNSTATD" />
            <bitfield mask="0x00000010" name="CNSTATD" />
            <bitfield mask="0x00000020" name="CNSTATD" />
            <bitfield mask="0x00000040" name="CNSTATD" />
            <bitfield mask="0x00000080" name="CNSTATD" />
            <bitfield mask="0x00000100" name="CNSTATD" />
            <bitfield mask="0x00000200" name="CNSTATD" />
            <bitfield mask="0x00000400" name="CNSTATD" />
            <bitfield mask="0x00000800" name="CNSTATD" />
            <bitfield mask="0x00001000" name="CNSTATD" />
            <bitfield mask="0x00002000" name="CNSTATD" />
            <bitfield mask="0x00004000" name="CNSTATD" />
            <bitfield mask="0x00008000" name="CNSTATD" />
         </register>
         <register caption="" name="CNSTATE" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE" />
            <bitfield mask="0x00000002" name="CNSTATE" />
            <bitfield mask="0x00000004" name="CNSTATE" />
            <bitfield mask="0x00000008" name="CNSTATE" />
            <bitfield mask="0x00000010" name="CNSTATE" />
            <bitfield mask="0x00000020" name="CNSTATE" />
            <bitfield mask="0x00000040" name="CNSTATE" />
            <bitfield mask="0x00000080" name="CNSTATE" />
            <bitfield mask="0x00000100" name="CNSTATE" />
            <bitfield mask="0x00000200" name="CNSTATE" />
            <bitfield mask="0x00000400" name="CNSTATE" />
            <bitfield mask="0x00000800" name="CNSTATE" />
            <bitfield mask="0x00001000" name="CNSTATE" />
            <bitfield mask="0x00002000" name="CNSTATE" />
            <bitfield mask="0x00004000" name="CNSTATE" />
            <bitfield mask="0x00008000" name="CNSTATE" />
         </register>
         <register caption="" name="CNSTATF" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF" />
            <bitfield mask="0x00000002" name="CNSTATF" />
            <bitfield mask="0x00000004" name="CNSTATF" />
            <bitfield mask="0x00000008" name="CNSTATF" />
            <bitfield mask="0x00000010" name="CNSTATF" />
            <bitfield mask="0x00000020" name="CNSTATF" />
            <bitfield mask="0x00000040" name="CNSTATF" />
            <bitfield mask="0x00000080" name="CNSTATF" />
            <bitfield mask="0x00000100" name="CNSTATF" />
            <bitfield mask="0x00000200" name="CNSTATF" />
            <bitfield mask="0x00000400" name="CNSTATF" />
            <bitfield mask="0x00000800" name="CNSTATF" />
            <bitfield mask="0x00001000" name="CNSTATF" />
            <bitfield mask="0x00002000" name="CNSTATF" />
            <bitfield mask="0x00004000" name="CNSTATF" />
            <bitfield mask="0x00008000" name="CNSTATF" />
         </register>
         <register caption="" name="CNSTATG" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG" />
            <bitfield mask="0x00000002" name="CNSTATG" />
            <bitfield mask="0x00000004" name="CNSTATG" />
            <bitfield mask="0x00000008" name="CNSTATG" />
            <bitfield mask="0x00000010" name="CNSTATG" />
            <bitfield mask="0x00000020" name="CNSTATG" />
            <bitfield mask="0x00000040" name="CNSTATG" />
            <bitfield mask="0x00000080" name="CNSTATG" />
            <bitfield mask="0x00000100" name="CNSTATG" />
            <bitfield mask="0x00000200" name="CNSTATG" />
            <bitfield mask="0x00000400" name="CNSTATG" />
            <bitfield mask="0x00000800" name="CNSTATG" />
            <bitfield mask="0x00001000" name="CNSTATG" />
            <bitfield mask="0x00002000" name="CNSTATG" />
            <bitfield mask="0x00004000" name="CNSTATG" />
            <bitfield mask="0x00008000" name="CNSTATG" />
         </register>
      </register-group>
      <value-group caption="Stop in Idle Control bit" name="CNCONB__SIDL">
         <value caption="CPU Idle Mode halts CN operation" name="" value="0x1" />
         <value caption="CPU Idle does not affect CN operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CNCONC__SIDL">
         <value caption="CPU Idle Mode halts CN operation" name="" value="0x1" />
         <value caption="CPU Idle does not affect CN operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
