MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX330F064H.atdf
         <register caption="Peripheral Pin Select Output Register" name="RPD11R" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD11R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPE3R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPE5R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE5R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF0R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF0R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF1R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF2R" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF3R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF4R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF4R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF5R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF5R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPF6R" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF6R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPG6R" offset="0x158" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG6R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPG7R" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG7R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPG8R" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG8R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPG9R" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG9R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="1">
      <register-group name="RTCC">
         <register caption="RTC Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE" />
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC" />
            <bitfield caption="RTCC Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC" />
            <bitfield caption="RTC Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN" />
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON" />
            <bitfield caption="RTCC Seconds Clock Output Select bit" mask="0x00000080" name="RTSECSEL" values="RTCCON__RTSECSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON" />
            <bitfield caption="RTC Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL" />
         </register>
         <register caption="RTC ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK" />
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC" />
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV" />
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME" />
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN" />
         </register>
         <register caption="RTC Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="RTC Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
            <bitfield mask="0x0F000000" name="YEAR01" />
            <bitfield mask="0xF0000000" name="YEAR10" />
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
